In [4]:
import pandas as pd 
import numpy as np

In [2]:
from sqlalchemy import create_engine

In [3]:
temp_db= create_engine('sqlite:///:memory:')

In [8]:
df = pd.DataFrame(data=np.random.randint(low=0,high=100,size=(4,4)),columns=['a','b','c','d'])

In [9]:
df

    a   b   c   d
0  21  58  51  81
1  72  62  82  91
2  63  79  21  70
3  74  12  10  35

creation of 'new_table'

In [16]:
df.to_sql(name='new_table',con=temp_db)

In [17]:
new_df = pd.read_sql(sql='new_table',con=temp_db)

In [21]:
new_df

   index   a   b   c   d
0      0  21  58  51  81
1      1  72  62  82  91
2      2  63  79  21  70
3      3  74  12  10  35

In [24]:
result = pd.read_sql_query(sql='SELECT a,c FROM new_table',con=temp_db)

In [25]:
result

    a   c
0  21  51
1  72  82
2  63  21
3  74  10